tutorials/verificationAndValidation/radiation-delete/1-cylindrical-enclosure-Dua-Cheng-1975/3-axisymmetric-feature/setups.orig/common/0.orig/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2301                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -3 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
/*
    "(pipe|inlet|outlet)"
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1;
        value           uniform 0;
    }
*/
    "(pipe|inlet|outlet)"
    {
        type            wideBandDiffusiveRadiation;
        value           uniform 0;
    }

    "(front|back)"
    {
        type            wideBandSpecularRadiation;
        patchType       wedge;
        value           uniform 0;
    }
}

// ************************************************************************* //
